'''
作者: Ackermannn
作业1:伪随机作业
某随机变量概率密度函数为f(x) = -0.5 * x + 1,用逆变法生成符合
分布的随机数,要求利用混合同余法生成均匀分布U(0,1)的随机序列,
令M = 16,A = 5 ,C = 3 ,S0 = 1.
'''
import numpy as np
list_number = 20     # 这里给定序列长度
M, A, C, S = 16, 5, 3, np.ones((list_number,)) # S 初始化

for i in range(1,list_number):  # 产生随机序列
    S[i] = (A * S[i-1] + C) % M
    
S /= M                      # 生成 U(0,1)
S = -2 * np.sqrt(1-S) + 2   # 逆变法
print(S)
'''
输出结果
[0.06350833 0.58578644 0.88196601 0.77525513 0.3416876  1.
 1.5        1.29289322 0.67712434 0.         0.19722436 0.12917131
 1.1339746  0.26794919 0.5        0.41886117 0.06350833 0.58578644
 0.88196601 0.77525513]
'''
